---
kind: type
id: T:Autodesk.Revit.DB.ViewSetIterator
source: html/e48382db-8299-23f2-0491-996100e5ee14.htm
---
# Autodesk.Revit.DB.ViewSetIterator

An iterator to a view set.

## Syntax (C#)
```csharp
public abstract class ViewSetIterator : APIObject,
	IEnumerator
```